[
  {
    "timeLineID": 1,
    "name": "OLP - ACM/ICPC Asia Cần Thơ 2011 tại CTU",
    "tag": null,
    "description": "Theo ghi nhận của Hội Tin Học Việt Nam, đến ngày 29/02 đã có gần 100 đội tuyển đăng ký thi ACM/ICPC Việt Nam tại Cần Thơ. Năm nay chỉ cho phép 100 đội tuyển đăng ký thi ACM/ICPC Cần Thơ theo phương thức đến trước có chỗ, chỉ dành nhiều nhất 25 chỗ cho các đội không chuyên và cao đẳng. Đây là 1 năm hết sức khó khăn cho các đội tuyển của ĐH Công Nghiệp TP. Hồ Chí Minh khi phải cố gắng lấy được càng nhiều suất thi càng tốt. Với 3 ngày thi đầy khó khăn và thử thách cùng các đối thủ mạnh khác thì Đội tuyển của ĐH Công Nghiệp TP. Hồ Chí Minh đã có những thành tích thật sự đáng nể.",
    "year": 2011,
    "title":"The ACM/ICPC 2011 Asia Can Tho Regional Contest"
  },
  {
    "timeLineID": 2,
    "name": "OLP - ACM/ICPC Asia Hồ Chính Minh 2014 tại IUH",
    "tag": null,
    "description": "Ngày 27/09/2014, Khoa Công nghệ Thông tin – Trường ĐH Công Nghiệp Tp. Hồ Chí Minh đã tổ chức thành công vòng Quốc gia Online ACM/ICPC 2014. Trường ĐH Công Nghiệp TP. Hồ Chí Minh có 24 Đội dự thi. Sau 3 ngày tranh tài sôi nổi, tối 31 tháng 10 năm 2014, Lễ bế mạc và trao giải cuộc thi Olympic tin học sinh viên Việt Nam lần thứ 23 và kỳ thi Lập trình sinh viên quốc tế ACM/ICPC TP. Hồ Chí Minh 2014 đã diễn ra tại Trường ĐH Công nghiệp TP. Hồ Chí Minh. Ở khối thi tập thể ACM/ICPC, kỳ thi quốc tế ACM/ICPC TP. Hồ Chí Minh 2014 có sự tham gia của 107 đội đến từ 66 học viện, ĐH, CĐ. Theo tiến sĩ Nguyễn Quang Huy, Trưởng ban giám khảo kỳ thi ACM/ICPC, đề thi năm nay hay hơn, mang lại rất nhiều kịch tính. Nhiều đội có khả năng cạnh tranh cao với các đội quốc tế. Tuy nhiên, chỉ có một đội làm được nhiều nhất – 8 bài. Kết quả, khối thi tập thể ACM/ICPC, khối chuyên tin: đội Brainfock – University of Engineering and Technology – VNU (ĐH Công Nghệ Hà nội) đạt giải vô địch. Còn lại, 3 giải nhất, 4 giải nhì, 4 giải 3. Khối không chuyên: đội EnEoDi – People’s Security University đạt giải nhất, còn lại 1 giải nhì, 1 giải 3.",
    "year": 2014,
    "title":"The ACM/ICPC 2014 Asia Ho Chi Minh City Regional Contest"
  },
  {
    "timeLineID": 2,
    "name": "OLP - ACM/ICPC Asia Nha Trang 2016 tại NTU",
    "tag": null,
    "description": "Tham dự kỳ thi Lập trình quốc tế ACM/ICPC khu vực châu Á lần thứ 42-2016 có 116 Nhóm/Đội đến từ 57 trường Việt Nam và châu Á. Trong đó, có 13 đội mạnh đến từ các trường ĐH nổi tiếng như Đại học Quốc gia Seoul, Đại học Giao thông vận tải Trung Quốc, Đại học Quốc gia Đài Loan, Đại học Quốc gia Singapore, Đại học Quốc gia Indonesia...). Ở cuộc thi năm nay ĐH Công Nghiệp TP.Hồ Chí Minh có 10 Đội rải đều ở các bảng Siêu Cúp cho đến bảng Chuyên, bảng Không Chuyên và bảng Cao Đẳng. Và cũng gặt hái được những thành tích đáng nể.",
    "year": 2016,
    "title":"The ACM/ICPC 2016 Asia Nha Trang Regional Contest"
  },
  {
    "timeLineID": 3,
    "name":"OLP - ACM/ICPC Asia Hồ Chí Minh 2017 tại HCMUE",
    "tag": null,
    "description": "OLP - ACM/ICPC Asia Hồ Chí Minh City 2017 tổ chức tại Khu giáo dục thể chất - trường Đại học Sư phạm TP. Hồ Chí Minh. Do năm 2017 có gần 150 teams đăng ký. Gồm 99 Teams của Việt Nam và 23 Teams Quốc tế. Đây là một trong những kỳ thi ACM/ICPC Asia lớn nhất từ trước đến nay. Trong đó ĐH Công Nghiệp TP.Hồ Chí Minh có 13 Đội tham gia tranh tài đủ ở các bảng.",
    "year":2017,
    "title": "The ACM/ICPC 2017 Asia Ho Chi Minh City Regional Contest"
  },
  {
    "timeLineID": 4,
    "name":"OLP - ACM/ICPC Asia Hà Nội 2018 tại PTIT",
    "tag": null,
    "description": "Từ ngày 27-30/11/2018, cùng với Olympic Tin học Sinh viên Việt Nam lần thứ 27 (OLP’18), Kỳ thi lập trình sinh viên quốc tế ICPC khu vực châu Á, điểm thi Hà Nội - ICPC Asia Hanoi 2018 sẽ được tổ chức với 125 đội tham dự, trong đó có 18 đội quốc tế. Olympic Tin học Sinh viên Việt Nam lần thứ 27 (OLP’18) kết nối cùng Kỳ thi lập trình sinh viên quốc tế ICPC Asia Hanoi 2018 sắp diễn ra tại Học viện Công nghệ Bưu chính Viễn thông (PTIT). Là sự kiện do Hội Tin học Việt Nam, Hội Sinh viên Việt Nam và Bộ GD&ĐT tổ chức, OLP’18 và ICPC Asia Hanoi 2018 sẽ là ngày hội của các tài năng trẻ CNTT-TT Việt Nam và châu Á. Trong đó ĐH Công Nghiệp TP.Hồ Chí Minh có 4 Đội tham gia tranh tài, năm nay có những đối thủ nặng ký vì vậy rất nhọc nhằn và khó khăn cho ĐH Công Nghiệp TP.HCM nhưng cũng đã đạt được những thành tích nhất định.",
    "year":2018,
    "title": "The ICPC 2018 Asia Ha Noi Regional Contest"
  },
  {
    "timeLineID": 5,
    "name":"OLP - ACM/ICPC Asia Đà Nẵng 2019 tại DNUT",
    "tag": null,
    "description": "Đây là 1 mùa giải hết sức khó khăn và đầy cảm xúc, bla bla blac, etc......",
    "year":2019,
    "title": "The ICPC 2019 Asia Da Nang Regional Contest"
  },
  {
    "timeLineID": 6,
    "name":"OLP - ACM/ICPC Asia Cần Thơ 2020 tại CTU",
    "tag": null,
    "description": "Đây là 1 mùa giải hết sức khó khăn và đầy cảm xúc, bla bla blac, etc......",
    "year":2020,
    "title": "The ICPC 2020 Asia Can Tho Regional Contest"
  },
  {
    "timeLineID": 7,
    "name":"OLP - ACM/ICPC Asia Hà Nội 2021 tại FPTU ",
    "tag": null,
    "description": "Đây là 1 mùa giải hết sức khó khăn và đầy cảm xúc, bla bla blac, etc......",
    "year":2021,
    "title": "The 2021 ICPC Asia Hanoi Regional Contest"
  },
  {
    "timeLineID": 8,
    "name":"OLP - ACM/ICPC Asia Hồ Chí Minh 2022 tại HCMUTE",
    "tag": null,
    "description": "Đây là 1 mùa giải hết sức khó khăn và đầy cảm xúc, bla bla blac, etc......",
    "year":2022,
    "title": "The 2022 ICPC Asia Ho Chi Minh City Regional Contest"
  },
  {
    "timeLineID": 9,
    "name":"OLP - ACM/ICPC Asia Huế 2023 tại HUSC",
    "tag": null,
    "description": "Đây là 1 mùa giải hết sức khó khăn và đầy cảm xúc, bla bla blac, etc......",
    "year":2023,
    "title": "OLP - ACM/ICPC Asia Huế 2023"
  }
]