[
  {
    "timeLineID": 1,
    "name": "OLP - ACM/ICPC Asia Cần Thơ 2011 tại CTU",
    "tag": null,
    "description": "Theo ghi nhận của Hội Tin Học Việt Nam, đến ngày 29/02 đã có gần 100 đội tuyển đăng ký thi ACM/ICPC Việt Nam tại Cần Thơ. Năm nay chỉ cho phép 100 đội tuyển đăng ký thi ACM/ICPC Cần Thơ theo phương thức đến trước có chỗ, chỉ dành nhiều nhất 25 chỗ cho các đội không chuyên và cao đẳng. Đây là 1 năm hết sức khó khăn cho các đội tuyển của ĐH Công Nghiệp TP.Hồ Chí Minh khi phải cố gắng lấy được càng nhiều suất thi càng tốt. Với 3 ngày thi đầy khó khăn và thử thách cùng các đối thủ mạnh khác thì Đội tuyển của ĐH Công Nghiệp TP.Hồ Chí Minh đã có những thành tích thật sự đáng nể.",
    "year": 2011,
    "title":"The ACM/ICPC 2011 Asia Can Tho Regional Contest"
  },
  {
    "timeLineID": 2,
    "name": "OLP - ACM/ICPC Asia Hồ Chí Minh 2014 tại IUH",
    "tag": null,
    "description": "Ngày 27/09/2014, Khoa Công nghệ Thông tin – Trường ĐH Công Nghiệp Tp. Hồ Chí Minh đã tổ chức thành công vòng Quốc gia Online ACM/ICPC 2014. Trường ĐH Công Nghiệp TP. Hồ Chí Minh có 24 Đội dự thi. Sau 3 ngày tranh tài sôi nổi, tối 31 tháng 10 năm 2014, Lễ bế mạc và trao giải cuộc thi Olympic Tin học sinh viên Việt Nam lần thứ 23 và kỳ thi Lập trình sinh viên quốc tế ACM/ICPC TP.Hồ Chí Minh 2014 đã diễn ra tại Trường ĐH Công Nghiệp TP. Hồ Chí Minh. Ở khối thi tập thể ACM/ICPC, kỳ thi quốc tế ACM/ICPC TP. Hồ Chí Minh 2014 có sự tham gia của 107 đội đến từ 66 học viện, ĐH, CĐ. Theo tiến sĩ Nguyễn Quang Huy, Trưởng ban giám khảo kỳ thi ACM/ICPC, đề thi năm nay hay hơn, mang lại rất nhiều kịch tính. Nhiều đội có khả năng cạnh tranh cao với các đội quốc tế. Tuy nhiên, chỉ có một đội làm được nhiều nhất – 8 bài. Kết quả, khối thi tập thể ACM/ICPC, khối chuyên tin: đội Brainfock – University of Engineering and Technology – VNU (ĐH Công Nghệ Hà Nội) đạt giải vô địch. Còn lại, 3 giải nhất, 4 giải nhì, 4 giải 3. Khối không chuyên: đội EnEoDi – People’s Security University đạt giải nhất, còn lại 1 giải nhì, 1 giải 3.",
    "year": 2014,
    "title":"The ACM/ICPC 2014 Asia Ho Chi Minh City Regional Contest"
  },
  {
    "timeLineID": 3,
    "name": "OLP - ACM/ICPC Asia Hà Nội 2015 tại UET",
    "tag": null,
    "description": "Mùa giải OLP - ACM/ICPC 2015 đã kết thúc nhưng dư âm của nó ắt hẵn vẫn còn đâu đó trong mỗi thành viên đội tuyển, cả bây giờ và mãi mãi về sau. Chuyến đi gặt hái nhiều thành tích bởi những bằng khen, giải thưởng và cả những kỳ tích không đo đếm được. Thành công của chuyến đi, ở một khía cạnh khác thể hiện ở việc lấy đi nhiều nước mắt của thầy và trò, niềm vui vỡ òa khi chạm đỉnh thành công và cả những nuối tiếc khi chạm xà ngang cột dọc để rồi bật khỏi khung thành. Nhưng không sao, 'Nếu tất cả đường đời trơn láng. Chắc gì ta đã nhận ra ta'. Những gì k8 chưa làm được sẽ là mục tiêu của k9, k10, k11...Nhất định đội tuyển IUH sẽ ghi tên mình vào bản đồ CNTT Việt Nam và thế giới. Một khi các bạn vẫn còn sức chiến đấu, kỳ tích nhất định sẽ xuất hiện. Năm nay chúng ta đã làm rất rất rất tốt rồi, Giải 3 Olympic Tin học khối Chuyên Tin là 1 cái gì đó đáng để tự hao !!",
    "year": 2015,
    "title": "The ACM/ICPC 2015 Asia Ha Noi Regional Contest"
  },
  {
    "timeLineID": 4,
    "name": "OLP - ACM/ICPC Asia Nha Trang 2016 tại NTU",
    "tag": null,
    "description": "Tham dự kỳ thi Lập trình quốc tế ACM/ICPC khu vực châu Á lần thứ 42-2016 có 116 Nhóm/Đội đến từ 57 trường Việt Nam và châu Á. Trong đó, có 13 đội mạnh đến từ các trường ĐH nổi tiếng như ĐH Quốc gia Seoul, ĐH Giao thông vận tải Trung Quốc, ĐH Quốc gia Đài Loan, ĐH Quốc gia Singapore, ĐH Quốc gia Indonesia...). Ở cuộc thi năm nay ĐH Công Nghiệp TP.Hồ Chí Minh có 10 Đội rải đều ở các bảng Siêu Cúp cho đến bảng Chuyên, bảng Không Chuyên và bảng Cao Đẳng. Và cũng gặt hái được những thành tích đáng nể.",
    "year": 2016,
    "title":"The ACM/ICPC 2016 Asia Nha Trang Regional Contest"
  },
  {
    "timeLineID": 5,
    "name":"OLP - ACM/ICPC Asia Hồ Chí Minh 2017 tại HCMUE",
    "tag": null,
    "description": "OLP - ACM/ICPC Asia Hồ Chí Minh City 2017 tổ chức tại Khu giáo dục thể chất - Trường ĐH Sư phạm TP.Hồ Chí Minh. Do năm 2017 có gần 150 teams đăng ký. Gồm 99 Teams của Việt Nam và 23 Teams Quốc tế. Đây là một trong những kỳ thi ACM/ICPC Asia lớn nhất từ trước đến nay. Trong đó ĐH Công Nghiệp TP.Hồ Chí Minh có 15 Đội tham gia tranh tài trải dài đủ ở các bảng.",
    "year":2017,
    "title": "The ACM/ICPC 2017 Asia Ho Chi Minh City Regional Contest"
  },
  {
    "timeLineID": 6,
    "name":"OLP - ACM/ICPC Asia Hà Nội 2018 tại PTIT",
    "tag": null,
    "description": "Từ ngày 27-30/11/2018, cùng với Olympic Tin học Sinh viên Việt Nam lần thứ 27 (OLP’18), Kỳ thi lập trình sinh viên quốc tế ICPC khu vực châu Á, điểm thi Hà Nội - ICPC Asia Hanoi 2018 sẽ được tổ chức với 125 đội tham dự, trong đó có 18 đội quốc tế. Olympic Tin học Sinh viên Việt Nam lần thứ 27 (OLP’18) kết nối cùng Kỳ thi lập trình sinh viên quốc tế ICPC Asia Hanoi 2018 sắp diễn ra tại Học viện Công nghệ Bưu chính Viễn thông (PTIT). Là sự kiện do Hội Tin học Việt Nam, Hội Sinh viên Việt Nam và Bộ GD&ĐT tổ chức, OLP’18 và ICPC Asia Hanoi 2018 sẽ là ngày hội của các tài năng trẻ CNTT-TT Việt Nam và châu Á. Trong đó ĐH Công Nghiệp TP.Hồ Chí Minh có 4 Đội tham gia tranh tài, năm nay có những đối thủ nặng ký vì vậy rất nhọc nhằn và khó khăn cho ĐH Công Nghiệp TP.HCM nhưng cũng đã đạt được những thành tích nhất định.",
    "year":2018,
    "title": "The ICPC 2018 Asia Ha Noi Regional Contest"
  },
  {
    "timeLineID": 7,
    "name":"OLP - ACM/ICPC Asia Đà Nẵng 2019 tại DNUT",
    "tag": null,
    "description": "Ngày 04/12, Trường ĐH Bách Khoa – ĐH Đà Nẵng đã tổ chức khai mạc Olympic Tin học Sinh viên Việt Nam lần thứ 28, Kỳ thi Procon và Kỳ thi Lập trình Sinh viên Quốc tế Khu vực Châu Á – Đà Nẵng năm 2019. Đây là sự kiện biểu dương tài năng, kỹ năng công nghệ thông tin dành cho sinh viên quy mô quốc tế lớn nhất Việt Nam. Kỳ thi lần lượt diễn ra từ ngày 04 – 07/12/2019. Cuộc thi thu hút gần 700 sinh viên, 150 huấn luyện viên từ 71 trường ĐH, CĐ đăng ký các nội dung Olympic, với gần 468 sinh viên chính thức dự thi 5 khối thi, 30 đội tuyển tranh tài Procon. Kỳ thi ICPC có 112 độit uyển tham dự ,trong đó Việt Nam có 95 đội và 17 đội quốc tế đến từ Nhật Bản, Hàn Quốc, Singapore, Trung Quốc, Indonesia, Myanmar,… Các đội tuyển đến từ các trường mạnh và nổi tiếng như Pekin University, ĐH Giao Thông Thượng Hải, ĐH Quốc gia Indonesia, ĐH Quốc gia Kyoto, ĐH Korea, ĐH Quốc gia Singapore. Sau 3 ngày tranh tài sôi nổi, vào lúc 17h00, ngày 06/12/2019, tại Trường ĐH Bách Khoa - ĐH Đà Nẵng đã diễn ra Lễ Tổng kết và Trao giải cuộc thi OLP’19 và ICPC khu vực Châu Á năm 2019. Ở mùa thi năm nay Trường ĐH Công Nghiệp TP.Hồ Chí Minh có 4 đội tham gia, đạt được thành tích Giải Nhất khối Cao đẳng thuộc về ĐH Công Nghiệp TP.Hồ Chí Minh",
    "year":2019,
    "title": "The ICPC 2019 Asia Da Nang Regional Contest"
  },
  {
    "timeLineID": 8,
    "name":"OLP - ACM/ICPC Asia Cần Thơ 2020 tại CTU",
    "tag": null,
    "description": "Lập trình sinh viên quốc tế ICPC là kỳ thi lập trình đẳng cấp có quy mô toàn cầu, được diễn ra hàng năm ở các quốc gia, châu lục để chọn đội tuyển tham dự vòng thi toàn cầu- World Final. Tuy chỉ mới tham gia các kỳ thi này từ năm 2011, khá trễ so với bề dày lịch sử 17 năm của Việt Nam, nhưng IUH đã nhanh chóng vươn lên, lọt tốp 10 trường có thành tích tốt nhất trong 3 năm gần đây và được xếp vào tốp trường mạnh nhất ở sân chơi sinh viên đầy thách thức này. Và năm nay IUH được lựa chọn là 1 trong 16 điểm thi ICPC Quốc gia trong thời gian từ ngày 11 đến 13/11 vừa qua nhằm chọn ra các đội thi xuất sắc nhất đại diện Việt Nam tham dự vòng Asia regional sẽ diễn ra vào tháng 12/2022. Trải qua 5 giờ căng thẳng, đội tuyển các trường đã thi đấu hết mình để giải quyết được càng nhiều bài toán trên máy tính thì cơ hội đi tiếp vào vòng trong càng cao. Mục tiêu của IUH năm nay là dành được 5 suất trong tổng số 100 team tốt nhất Việt Nam để đến với đấu trường Châu Á.",
    "year":2020,
    "title": "The ICPC 2020 Asia Can Tho Regional Contest"
  },
  {
    "timeLineID": 9,
    "name":"OLP - ACM/ICPC Asia Hà Nội 2021 tại FPTU ",
    "tag": null,
    "description": "Hàng năm vào mùa code, sinh viên yêu thích lập trình trên toàn thế giới tham gia thử thách ở các vòng thi Lập trình sinh viên quốc tế ICPC để cạnh tranh suất vào chung kết World final. Ở mỗi kỳ thi đó, nhiệm vụ của các đội tuyển (team gồm 3 thành viên) phải hái được càng nhiều trái bóng (tương ứng với việc giải quyết thành công các bài toán trên máy tính) thì cơ hội tiến sâu vào chung kết càng cao. Vượt qua khúc cua Covid, sau nhiều lần đổi lịch, kỳ thi ICPC Quốc gia 2021 với sự tham gia của 363 teams đã diễn ra sáng nay ngày 20/2/2022 tại 10 điểm trường trên toàn quốc. Đây là vòng tranh giải, xếp hạng Quốc gia và xét tuyển 100 teams tới Hà Nội tham dự ICPC Asia Hanoi tranh Giải và các suất danh giá đại diện Châu Á tham dự Chung kết toàn cầu ICPC 2022. Đây cũng là vòng thi tranh giải ICPC Quốc gia cuối cùng cho học sinh các trường PTTH chuẩn bị sẵn sàng cho Kỳ thi học sinh giỏi Quốc gia (vào đầu tháng 3/2022), chính vì vậy mức độ minh bạch, chuẩn mực và công bằng rất được Ban tổ chức chú trọng và các đội tuyển nghiêm túc tuân thủ. Tại ĐH Công Nghiệp TP.Hồ Chính Minh, 1 trong 10 điểm thi được Ban tổ chức thành lập để giản cách thí sinh, 12 đội tuyển mạnh nhất của trường tranh đấu ở vòng quốc gia với mục tiêu có 5 teams vào vòng Châu Á. Trung thực trong cuộc thi và tuân thủ 5K là 2 yếu tố chúng tôi luôn cam kết để cùng Ban tổ chức thực hiện thành công kỳ thi trong bối cảnh đặc biệt của mùa code 2022. Chỉ thay đổi phương pháp, không dịch chuyển mục tiêu, nhất định Đại học Công nghiệp Thành phố Hồ Chí Minh sẽ có những đại diện xuất sắc tham gia ngày hội sinh viên công nghệ thông tin tại ĐH FPT Hà Nội vào cuối tháng 03/2022. Với sự góp mặt của 4 Đội tại vòng Châu Á, đội tuyển OLP - ACM/ICPC của trường ĐH Công Nghiệp TP.Hồ Chính Minh cũng đã gặt hái được nhiều thành tích đáng nể !!!",
    "year":2021,
    "title": "The 2021 ICPC Asia Hanoi Regional Contest"
  },
  {
    "timeLineID": 10,
    "name":"OLP - ACM/ICPC Asia Hồ Chí Minh 2022 tại HCMUTE",
    "tag": null,
    "description": "CHÚC MỪNG ĐỘI TUYỂN ĐẠI HỌC CÔNG NGHIỆP TP.HCM ĐẠT NHIỀU GIẢI THƯỞNG CAO TẠI OLYMPIC TIN HỌC SINH VIÊN VIỆT NAM !!!! Nối tiếp thành tích ICPC, ngày 09/12/2022 đội tuyển OLP đã tạo nên thành công vang dội tại đấu trường Olympic Tin học sinh viên Việt Nam với sự đóng góp của 3 chiến binh đến từ lớp ĐHKHDL17A. Chúc mừng Giải Nhì bảng Chuyên tin của sinh viên Trương Đức Tài (ĐHKHDL17A), Giải Ba chuyên tin của sinh viên Trần Văn Nhân (ĐHKTPM15B) và 3 Giải Nhì bảng Không Đhuyên của sinh viên Lâm Quang Phú (ĐHKHDL17A), sinh viên Nguyễn Văn Nam (ĐHKHDL17A) và sinh viên Trần Lộc (ĐHKTPM15B). Lần đầu tiên sau 12 năm chinh chiến tại cuộc thi lớn này, thì Giải Nhì chuyên Tin đã xuất hiện. Lần đầu tiên bảng Không Chuyên đạt cùng lúc 3 Giải Nhì, chung sân khấu cùng màu áo vàng tạo nên thương hiệu mang tên Trường ĐH Công Nghiệp TP.Hồ Chí Minh. Chúc mừng các bạn vì nỗ lực không ngừng nghỉ để đạt được kết quả xứng đáng !",
    "year":2022,
    "title": "The 2022 ICPC Asia Ho Chi Minh City Regional Contest"
  },
  {
    "timeLineID": 11,
    "name":"OLP - ACM/ICPC Asia Huế 2023 tại HUSC",
    "tag": null,
    "description": "Đây là 1 mùa giải hết sức khó khăn và đầy cảm xúc, bla bla blac, etc......",
    "year":2023,
    "title": "OLP - ACM/ICPC Asia Huế 2023"
  }
]